In [1]:
import pandas as pd

In [2]:
dict1={
    'name':['sanjay','adithya','tanishk','nishan','sudeep','sharath'],
    'age':[20,20,21,20,23,21],
    'city':['padubidri','hejamadi','padubidri','malpe','road','opm'],
    'marks':[69,75,63,63,65,95]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      name  age       city  marks
0   sanjay   20  padubidri     69
1  adithya   20   hejamadi     75
2  tanishk   21  padubidri     63
3   nishan   20      malpe     63
4   sudeep   23       road     65
5  sharath   21        opm     95

In [5]:
df.head(3)

      name  age       city  marks
0   sanjay   20  padubidri     69
1  adithya   20   hejamadi     75
2  tanishk   21  padubidri     63

In [6]:
df.tail(2)

      name  age  city  marks
4   sudeep   23  road     65
5  sharath   21   opm     95

In [7]:
# we can also convert the data after manipluation into excel file that csv file and can be exported by using command to_csv.('file name')
df.to_csv('dwags.csv')

In [8]:
# if we export like this the index numbers will also be exported if we dont want the indexnumber to be exported we can use index= False.
df.to_csv('dwags_without-indexnumber.csv',index = False)

In [9]:
# there is method in pandas describe().this method analyse all the numeric values in the dataframe and return some sepcific values and do stastical analyse.
df.describe()

             age      marks
count   6.000000   6.000000
mean   20.833333  71.666667
std     1.169045  12.307179
min    20.000000  63.000000
25%    20.000000  63.500000
50%    20.500000  67.000000
75%    21.000000  73.500000
max    23.000000  95.000000

In [10]:
# if you want to open a external csv file or excel file in jupyter to do some modification then we use pd.read_csv('filename') method to open.
# opm = read_csv('opm.csv')
# opm
# if we execute these two lines then we can access the external files.